/**************************************************************************************************
 *                                 ФАЙЛОВЫЕ ОПЕРАЦИИ С ОБЛАКАМИ
 **************************************************************************************************
 */

/**
 * Интерфейс открытия облака точек из файла 
 */
public interface ICloudReader
{
	PointCloud OpenCloud(String filename);
}

/**
 * Интерфейс сохранения облака точек
 */
public interface ICloudWriter
{
	void SaveCloud(PointCloud cloud, String filename);
}